---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Wattage
source: html/29417a31-3829-be5b-9fbe-3daecebcc571.htm
---
# Autodesk.Revit.DB.SpecTypeId.Wattage Property

Wattage, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId Wattage { get; }
```